# Pandas - exercises
Using the marriage dataset solve the following exercises:

In [2]:
import numpy as np
import pandas as pd
import statsmodels.api as sm
from IPython.display import display
# http://statsmodels.sourceforge.net/devel/datasets/generated/fair.html
data = sm.datasets.fair.load_pandas()
marr = data.exog

Show the first three and the last three rows using display function (remember to import it)

In [9]:
display(marr.head(5))
display(marr.tail(5))

,rate_marriage,age,yrs_married,children,religious,educ,occupation,occupation_husb
0,3.0,32.0,9.0,3.0,3.0,17.0,2.0,5.0
1,3.0,27.0,13.0,3.0,1.0,14.0,3.0,4.0
2,4.0,22.0,2.5,0.0,1.0,16.0,3.0,5.0
3,4.0,37.0,16.5,4.0,3.0,16.0,5.0,5.0
4,5.0,27.0,9.0,1.0,1.0,14.0,3.0,4.0

,rate_marriage,age,yrs_married,children,religious,educ,occupation,occupation_husb
6361,5.0,32.0,13.0,2.0,3.0,17.0,4.0,3.0
6362,4.0,32.0,13.0,1.0,1.0,16.0,5.0,5.0
6363,5.0,22.0,2.5,0.0,2.0,14.0,3.0,1.0
6364,5.0,32.0,6.0,1.0,3.0,14.0,3.0,4.0
6365,4.0,22.0,2.5,0.0,2.0,16.0,2.0,4.0

Create a new dataset which contains all the original dataset's columns except occupation.

In [13]:
marr1 = marr.drop("occupation", axis = 1)
marr1.head()

,rate_marriage,age,yrs_married,children,religious,educ,occupation_husb
0,3.0,32.0,9.0,3.0,3.0,17.0,5.0
1,3.0,27.0,13.0,3.0,1.0,14.0,4.0
2,4.0,22.0,2.5,0.0,1.0,16.0,5.0
3,4.0,37.0,16.5,4.0,3.0,16.0,5.0
4,5.0,27.0,9.0,1.0,1.0,14.0,4.0

Check how many unique values the children variable has. Display summary statistics about this variable.

In [17]:
print(f"Unique values: {marr.children.nunique()}")
display(marr.children.describe())

Unique values: 6

count    6366.000000
mean        1.396874
std         1.433471
min         0.000000
25%         0.000000
50%         1.000000
75%         2.000000
max         5.500000
Name: children, dtype: float64

Create a variable containing natural logarithm of age.

In [27]:
marr["log_age"] = np.log(marr.age)
marr.head()

,rate_marriage,age,yrs_married,children,religious,educ,occupation,occupation_husb,log_age
0,3.0,32.0,9.0,3.0,3.0,17.0,2.0,5.0,3.465736
1,3.0,27.0,13.0,3.0,1.0,14.0,3.0,4.0,3.295837
2,4.0,22.0,2.5,0.0,1.0,16.0,3.0,5.0,3.091042
3,4.0,37.0,16.5,4.0,3.0,16.0,5.0,5.0,3.610918
4,5.0,27.0,9.0,1.0,1.0,14.0,3.0,4.0,3.295837

Create a discrete variable for education which denotes education level (instead of years of education) in ascending order.

In [43]:
levels = list(marr["educ"].unique())
levels.sort()

marr2 = marr
marr2["educ_level"] = marr2["educ"].map(lambda x: str(levels.index(x)+1))
marr2.head(5)

,rate_marriage,age,yrs_married,children,religious,educ,occupation,occupation_husb,log_age,educ_level
0,3.0,32.0,9.0,3.0,3.0,17.0,2.0,5.0,3.465736,5
1,3.0,27.0,13.0,3.0,1.0,14.0,3.0,4.0,3.295837,3
2,4.0,22.0,2.5,0.0,1.0,16.0,3.0,5.0,3.091042,4
3,4.0,37.0,16.5,4.0,3.0,16.0,5.0,5.0,3.610918,4
4,5.0,27.0,9.0,1.0,1.0,14.0,3.0,4.0,3.295837,3

Using numpy draw a random income from log-normal distribution for each observation. Use such parameters that income looks credible taking current market conditions into account and that expected value for income increases with years of education.

Select and display rows which fulfill the following criteria:
* People who have at least two children
* People who have at least two children and are over 30 years old
* People who have at least two children and are over 30 years old, but not over 40 years old.

In [47]:
marr.query('children > 1').head()
marr.query('children > 1 & age > 30').head()
marr.query('children > 1 & age > 30 & age < 40').head()

,rate_marriage,age,yrs_married,children,religious,educ,occupation,occupation_husb,log_age,educ_level
0,3.0,32.0,9.0,3.0,3.0,17.0,2.0,5.0,3.465736,5
3,4.0,37.0,16.5,4.0,3.0,16.0,5.0,5.0,3.610918,4
6,5.0,37.0,23.0,5.5,2.0,12.0,5.0,4.0,3.610918,2
7,5.0,37.0,23.0,5.5,2.0,12.0,2.0,3.0,3.610918,2
12,3.0,37.0,16.5,5.5,1.0,12.0,2.0,3.0,3.610918,2

* Add a row (fill all the values manually) for a person with seven children.
* Change all the values in such a way that all people having three children would have four children.

For people who have: no children, 1 child, 2 children and so on (make sure you display all values) select and display first 5 rows of people who are over 40 years old. Use query and @ operator.

Tip: You can iterate over marr.children.unique()

* Group observations by variable "rate" and calculate income's mean and standard deviation for each of the groups.
* Get rid of unnecessary MultiIndex.

For every row assign the mean income of people who have the same values of rate and level of education (defined earlier).

For every row calculate the difference between income and mean income for a group of people who have the same values of rate and level of education (defined earlier). Do it in one statement (one line, no semicolon) not using the variable created earlier.

For every row assign a variable containing the word "yes" if a person have more than one child and income below average and the word "no" otherwise.

Group people by education level and describe the group using .describe().